#pragma once
#include <memory>
#include "xstring"
#include "Memory.h"
#include "Functions.h"
//#include "reclass/netPlayerData.hpp"
//#include "reclass/CNetGamePlayer.hpp"
//#include "reclass/CNetworkPlayerMgr.hpp"

#include "reclass/GTAV-Classes/network/CNetGamePlayer.hpp"
#include "reclass/GTAV-Classes/network/CNetworkPlayerMgr.hpp"
#include "reclass/GTAV-Classes/script/scriptHandler.hpp"
#include "reclass/GTAV-Classes/network/netObject.hpp"

#include <stdio.h>
#include <stdint.h>

#define __int64 long long

class simpletime2 {
private:
	std::uint64_t mreadyat;
	bool mtick;
public:
	void start(std::uint64_t ticks) {
		if (this->mtick) {
			this->mreadyat = GetTickCount64() + ticks;
			this->mtick = false;
		}
	}
	bool is_ready() {
		return GetTickCount64() > this->mreadyat;
	}
	void reset() {
		this->mtick = true;
	}
};


// 
//#define PlayerIndex uint32_t PlayerIndex
//typedef int                PlayerIndex;

//typedef void(__cdecl* GetNetPlayer2)(CNetGamePlayer* (uint32_t PlayerIndex));
//typedef void(__cdecl* NetworkPlayerMgr2)(CNetworkPlayerMgr**);


//typedef void(__cdecl* GetNetPlayer2)(CNetGamePlayer* (uint32_t PlayerIndex));
//typedef void(__cdecl* CNetworkPlayerMgr2)(CNetworkPlayerMgr**);

class G_Hooking
{
public:
	static void RainOverride(int64_t timecycle_manager, RainRGBColor* timecycle_data);
	static void TimecycleOverride(int64_t timecycle_manager, TimecycleData* timecycle_data);
	//static void* m_OriginalTimecycleOverride;

	/*static NetworkPlayerMgr2 m_NetworkPlayerMgr;
	static GetNetPlayer2 m_GetNetPlayer;*/
};

//class rlGamerHandle2
//{
//public:
//	uint64_t m_rockstar_id;
//	uint64_t m_unk;
//
//	inline rlGamerHandle2(uint64_t rockstar_id) :
//		m_rockstar_id(rockstar_id),
//		m_unk(3)
//	{
//	}
//};
//
//class rlSessionInfo2
//{
//public:
//	uint64_t m_unk;
//	uint64_t m_session_token;
//
//	// contains a subset of netPlayerData. host's data?
//	char pad_0000[8]; //0x0000
//	uint64_t m_rockstar_id; //0x0008
//	char pad_0010[52]; //0x0010
//	class rage::netAddress m_relay_ip; //0x0044
//	uint16_t m_relay_port; //0x0048
//	char pad_004A[2]; //0x004A
//	class rage::netAddress m_external_ip; //0x004C
//	uint16_t m_external_port; //0x0050
//	char pad_0052[2]; //0x0052
//	class rage::netAddress m_internal_ip; //0x0054
//	uint16_t m_internal_port; //0x0058
//	char pad_005A[6]; //0x005A
//};
//
//class rlSessionByGamerTaskResult2
//{
//public:
//	rlGamerHandle2 m_gamer_handle{ 0 };
//	rlSessionInfo2 m_session_info{};
//};
//
//class rlPresenceEventInviteAccepted2
//{
//public:
//	void* m_vft;
//	rlPresenceEventInviteAccepted2* m_self;
//	rage::netPlayerData m_local_data;
//	rlSessionInfo2 m_session_info;
//	rlGamerHandle2 m_some_handle;
//
//	rlPresenceEventInviteAccepted2(rage::netPlayerData& local_player_data, rlSessionInfo2& session_info, rlGamerHandle2& handle) :
//		m_local_data(local_player_data),
//		m_session_info(session_info),
//		m_some_handle(handle)
//	{
//		m_self = this;
//	}
//};
//class rlPresenceEventInviteAccepted2
//{
//public:
//	void* m_vft;
//	rlPresenceEventInviteAccepted2* m_self;
//	rage2::netPlayerData m_local_data;
//	rlSessionInfo2 m_session_info;
//	rlGamerHandle2 m_some_handle;
//
//	rlPresenceEventInviteAccepted2(rage2::netPlayerData& local_player_data, rlSessionInfo2& session_info, rlGamerHandle2& handle) :
//		m_local_data(local_player_data),
//		m_session_info(session_info),
//		m_some_handle(handle)
//	{
//		m_self = this;
//	}
//};

//typedef bool(__cdecl* fpIsDLCPresent)();
//typedef BOOL(__fastcall* tADD_OWNED_EXPLOSION)(Ped ped, Vector3 coords, int explosionType, float damageScale, BOOL isAudible, BOOL isInvisible, float cameraShake);
//static BOOL ADD_OWNED_EXPLOSION(Ped ped, Vector3 coords, int explosionType, float damageScale, BOOL isAudible, BOOL isInvisible, float cameraShake) { static tADD_OWNED_EXPLOSION oADD_OWNED_EXPLOSION = (tADD_OWNED_EXPLOSION)(Memory::pattern("48 8B C4 48 89 58 08 48 89 70 10 48 89 78 18 4C 89 70 20 55 48 8D 68 B9 48 81 EC ? ? ? ? 0F 29 70 E8 41 8B D8").count(1).get(0).get<void>()); return oADD_OWNED_EXPLOSION(ped, coords, explosionType, damageScale, isAudible, isInvisible, cameraShake); }

typedef int(__cdecl* fpNetworkCreateSynchronisedScene)(Vector3* pos, Vector3* rot, int unk0, int unk1, int unk2, float unk3, float unk4, float unk5);
typedef int(__cdecl* fpNetworkAddPedToSynchronisedScene)(Ped ped, int scene, char* dict, char* anim, float speed, float speedMult, int duration, int flag, float playRate, int unk1, int unk2);
typedef int(__cdecl* fpNetworkStartSynchronisedScene)(int scene);

class SyncScene
{
public:
	static fpNetworkCreateSynchronisedScene        create_synchronised_scene;
	static fpNetworkAddPedToSynchronisedScene      add_ped_to_synchronised_scene;
	static fpNetworkStartSynchronisedScene         start_synchronised_scene;
};

typedef void(__cdecl* patternglobal)(uintptr_t globalpattern);
typedef void(__cdecl* listblip)(uintptr_t bliplist);
typedef void(__cdecl* patternworld)(uintptr_t worldpattern);
typedef void(__cdecl* fpreplay)(uintptr_t replay);
typedef void(__cdecl* fplaylist)(uintptr_t playlist);

typedef void(__cdecl* fpunkmodel)(uintptr_t modelunk);

typedef unsigned long  uintptr;

class interreplay
{
public:
	uintptr ADDRESS_REPLAY_INTERFACE2;
	BYTE m_replayInterface,
		m_dwpReplayInterfaceBase,
		m_dwpPedInterface,
		m_dwpPedList,
		m_dwpPickUpInterface,
		m_dwpPickUpList;
};

typedef void(__cdecl* fphandlingindex)(uintptr_t index);
typedef void(__cdecl* fphandlinghash)(uintptr_t hash);



typedef void(__cdecl* fpPedPoolAddress)(uintptr_t PedPoolAddress);
typedef void(__cdecl* fpObjectPoolAddress)(uintptr_t ObjectPoolAddress);
typedef void(__cdecl* fpEntityPoolAddress)(uintptr_t EntityPoolAddress);
typedef void(__cdecl* fpVehiclePoolAddress)(uintptr_t VehiclePoolAddress);
typedef void(__cdecl* fpPickupObjectPoolAddress)(uintptr_t PickupObjectPoolAddress);


typedef void(__cdecl* fpvehicleClassOffset)(uintptr_t vehicleClassOffset);
typedef void(__cdecl* fpmodelNum1)(uintptr_t modelNum1);
typedef void(__cdecl* fpmodelNum2)(uintptr_t modelNum2);
typedef void(__cdecl* fpmodelNum3)(uintptr_t modelNum3);
typedef void(__cdecl* fpmodelNum4)(uintptr_t modelNum4);
typedef void(__cdecl* fpmodelHashTable)(uintptr_t modelHashTable);
typedef void(__cdecl* fpmodelHashEntries)(uintptr_t modelHashEntries);


struct UInt32
{
public:
};
struct UInt64
{
public:
};
struct UInt16
{
public:
};
struct IntPtr
{
public:
	static void* ToPointer();
};
typedef int var;


typedef void(__cdecl* fphandlingIndexOffset)(uintptr_t info);


typedef int Iterator;
//struct IntPtr
//{
//public:
//};
//class Type
//{
//public:
//};
//typedef unsigned int GetDelegateForFunctionPointer;
//typedef unsigned int mytest;
//static mytest GetDelegateForFunctionPointer(IntPtr ptr, Type t);
//
//typedef unsigned int GetHandlingDataByHashDelegate;
//typedef unsigned int GetHandlingDataByIndexDelegate;
//
//static GetHandlingDataByHashDelegate GetHandlingDataByHash;
//static GetHandlingDataByIndexDelegate GetHandlingDataByIndex;

//namespace GF
//{
/*struct*/namespace/*class*/ ThunderHooks
{
	/*public:*/
	extern bool loadplayerlist;
	extern int ridjoin;
	extern int ridplayer;
	/*extern std::string ridplayerstring;*/
	extern void RequestControlBypass(bool toggle);
	extern void RIDFunction();
	extern void RIDFunction2();
	extern void RIDFunction3();
	extern void RIDFunction4();
	extern void RIDFunction5();
	extern void RIDFunction6();
	extern void RIDFunction7();
	extern void RIDFunction8();
	extern void RIDFunction9();
	extern void RIDFunction10();
	extern void RIDFunction11();
	extern void RIDFunction12();
	extern void RIDFunction13();
	extern void RIDFunction14();
	extern void RIDFunction15();
	extern void RIDFunction16();
	extern void RIDFunction17();
	extern void RIDFunction18();
	extern void RIDFunction19();
	extern void RIDFunction20();
	extern void RIDFunction21();
	extern void RIDFunction22();
	extern void RIDFunction23();
	extern void RIDFunction24();
	extern void RIDFunction25();
	extern void RIDFunction26();
	extern void RIDFunction27();
	extern void RIDFunction28();
	extern void RIDFunction29();
	extern void RIDFunction30();

	extern void join_by_rockstar_id(uint64_t rid);
	extern 	void join__id();
	extern bool RIDJoinFriends(int64_t* a1, int* hash);
	extern bool RIDJoinFriendsV2(int* a1, __int64 a2, int* a3);
	extern int64_t* RIDJoinHandle(int32_t friendIndex);

	extern char RIDInviteFriends(void* presenceStruct, rlPresenceEventInviteAccepted* invite, int flags);
	extern char RIDInviteHandle(int metric_manager, rage::rlGamerHandle* handles, int count, rage::rlSessionByGamerTaskResult* result, int unk, bool* success, int* state);

	extern bool IncrementStatEvent(uint64_t net_event_struct, int64_t sender, int64_t unk);
	extern void DisableErrorScreen(char* entryHeader, char* entryLine1, int instructionalKey, char* entryLine2, BOOL p4, Any p5, Any* p6, Any* p7, BOOL background);
	extern bool simple_drop_g_SelectedPlayer;
}/*;*/

//class ThunderHooking
//{
//public:
//	friend struct ThunderHooks;
//	/*void* m_OriginalRIDJoinHandle{};
//	void* m_OriginalRIDJoinFriends{};*/
//private:
//};
/*static std::unique_ptr<ThunderHooking> g_Hooking;*/
//}
	/*__declspec(selectany) int global_int = 0;*/

typedef bool(__cdecl* fpIsDLCPresent)(std::uint32_t dlcHash);
//typedef bool(__cdecl* fpsIncrementStatEvent)(uint64_t net_event_struct, int64_t sender, int64_t unk);
//typedef bool(__cdecl* fpsIncrementStatEvent)(__int64 a1, __int64 a2, float a3);
typedef bool(__cdecl* fpsIncrementStatEvent)(__int64 a1, __int64 a2, __int64 a3);
//using increment_stat_event = bool(uint64_t net_event_struct, int64_t sender, int64_t a3);

typedef __int64(__cdecl* fpGetPlayerAddress)(Player);
typedef Entity(__cdecl* fpAddressToEntity)(__int64);
//typedef bool(__cdecl* fpSetName)();
typedef bool(__cdecl* fpTriggerScriptEvent)(int, void*, int, int, int);
typedef bool(__cdecl* fpSetLobbyWeather)(int, int, int, __int64);
//typedef bool(__cdecl* fpIncrementStatHook)(uint64_t net_event_struct, int64_t sender, int64_t unk);
//typedef bool(__cdecl* fpIncrementStatHook)(__int64 a1, __int64 a2, float a3);
typedef bool(__cdecl* fpIncrementStatHook)(__int64 a1, __int64 a2, __int64 a3);
//typedef void(__cdecl* fpAddOwnedExplosion)(Ped ped, float x, float y, float z, int explosionType, float damageScale, BOOL isAudible, BOOL isInvisible, float cameraShake);
typedef void(__cdecl* fpAddOwnedExplosion)(Ped ped, Vector3* pos, int explosionType, float damageScale, BOOL isAudible, BOOL isInvisible, float cameraShake);

typedef bool(__cdecl* fpAddTextCompSubstrPlayerName)(char* text);
typedef bool(__cdecl* fpEndTextCmdDisplayText)(float x, float y);
typedef bool(__cdecl* fpBeginTextCmdDisplayText)(char* text);
//typedef bool(__cdecl* fpIsPedShooting)(Ped ped);
typedef bool(__cdecl* fpSetLobbyTime)(int, int, int);
//typedef bool(__cdecl* fpGetPlayerPed)(Player player);
typedef char* (__cdecl* fpGetPlayerName)(Player player);

typedef BOOL(__cdecl* fpNetworkIsSessionStarted)();
//typedef void(__cdecl* Receive)(__int64* Received);
//typedef void(__cdecl* ChatPlayerID)(CNetGamePlayer*(__int64 ChatPlayer));
//typedef __int64(__cdecl* Receive)(__int64*);
//typedef __int64(__cdecl* ChatPlayerID)(CNetGamePlayer*(__int64));

//typedef BOOL(__cdecl* CNetworkIncrementStatEvent)(int64_t a1_Event, int64_t a2_sender);
//typedef char*(__cdecl* fpGetOnlineName)(Player player);
//typedef Ped(__cdecl* fpGetPlayerPedScriptIndex)(Player player);
typedef bool(__cdecl* fpSendMessage2)(char* message, int* networkHandle);
typedef void(__cdecl* fpSetVehicleFixed)(Vehicle vehicle);

typedef void(__cdecl* fpSetModelAsNoLongerNeeded)(Hash model);

//typedef void(__cdecl* fpspoofer)(spoofing spoof);

typedef bool(__cdecl* fpGED)(int eventGroup, int eventIndex, __int64* argStruct, int argStructSize);
//typedef bool(__cdecl*	fpNetworkRequestControlOfEntity)(Entity entity);
//typedef void(__cdecl* fpSetVehicleDeformationFixed)(Vehicle vehicle);
//typedef bool(_cdecl* fpFileRegister)(int*, const char*, bool, const char*, bool);
typedef uint32_t(__cdecl* fpFileRegister)(int* textureID, const char* fullPath, bool _true, const char* fileName, bool _false);
typedef BOOL(_cdecl* fpGetEventData)(int eventGroup, int eventIndex, uint64_t* argStruct, int argStructSize);
//using GetEventData = bool(std::int32_t eventGroup, std::int32_t eventIndex, std::int64_t* args, std::uint32_t argCount);
//GetEventData* m_GetEventData;

typedef BOOL(_cdecl* fpStatSetInt)(Hash statName, int value, BOOL save);
typedef BOOL(_cdecl* fpStatGetInt)(Hash statHash, int* outValue, int p2);
typedef BOOL(_cdecl* fpStatSetFloat)(Hash statName, float value, BOOL save);
typedef BOOL(_cdecl* fpStatSetBool)(Hash statName, BOOL value, BOOL save);
typedef void(__cdecl* fpREQUESTMODEL)(Hash model);
//typedef BOOL(__cdecl* fpHASMODELLOADED)(Hash model);
typedef BOOL(__cdecl* fpISMODELAVEHICLE)(Hash model);

//typedef void(__cdecl* twoBytes)(float x, float y, float z, int explosionType, float damageScale, BOOL isAudible, BOOL isInvisible, float cameraShake);
//typedef SHORT twoBytes;
typedef void(__cdecl* fpDrawRect)(float x, float y, float width, float height, int r, int g, int b, int a);
//typedef void(__cdecl*	fpDrawLine)(float x1, float y1, float z1, float x2, float y2, float z2, int red, int green, int blue, int alpha); //(Vector3* pos1, Vector3* pos2, int r, int g, int b, int a);
typedef BOOL(__cdecl* fpDrawNotification)(BOOL blink, BOOL showInBrief);
typedef uint64_t(__cdecl* fpGetNetworkTime)();
//typedef BOOL(__cdecl* fpSTARTPARTICLEFXNONLOOPEDONENTITY2)(char* effectName, Entity entity, float offsetX, float offsetY, float offsetZ, float rotX, float rotY, float rotZ, float scale, BOOL axisX, BOOL axisY, BOOL axisZ);
//typedef Object(__cdecl*	fp_CreateObject)(Hash modelHash, Vector3* pos, BOOL isNetwork, BOOL thisScriptCheck, BOOL dynamic);
//typedef BOOL(__cdecl* fpNetworkShopBeginService)(int* netshop, int p2, int p3, int p4, int amount, int bankVal);

typedef Pickup(_cdecl* fpCreateAmbientPickup)(DWORD pickupHash, Vector3* pos, int unk0, int value, DWORD modelHash, bool unk1, bool unk2);
//typedef void(__cdecl* fpCreateAmbientPickup2)(Hash pickupHash, float pos, float pos2, float pos3, int flag, int value, Hash modelHash, BOOL returnHandle, BOOL p8);
typedef void(_cdecl* SETVEHICLEFORWARDSPEED)(Vehicle vehicle, float speed);

typedef Vehicle(__cdecl* fpCreateVehicle)(Hash model, Vector3* pos, float heading, BOOL networked, BOOL unk2);

namespace cVehicleBypass
{
	extern Vehicle CVehBypass(Hash model, Vector3* pos, float heading, BOOL networked, BOOL unk2);
}
//typedef Player(__cdecl*	fpPlayerId)();
using fpGetLabelText = const char* (*) (void* this_, const char* label);

//using fpDisableErrorScreen = void(*)(char* entryHeader, char* entryLine1, int instructionalKey, char* entryLine2, BOOL p4, Any p5, Any* p6, Any* p7, BOOL background);

typedef void(__cdecl* fpRemoveWeapons)(Ped ped, Hash weaponHash);
//typedef bool(__cdecl* fpmstartgetsessionbygamerhandle)(int metric_manager, rlGamerHandle* handles, int count, rlSessionByGamerTaskResult* result, int unk, bool* success, int* state);
//typedef void(__cdecl* fpmsendinviteacceptedpresenceevent)(void* presenceStruct, rlPresenceEventInviteAccepted* invite, int flags);
typedef void(__cdecl* fpmpresencestruct)(PVOID);

using fpmstartgetsessionbygamerhandle = bool(*)(int metric_manager, rage::rlGamerHandle* handles, int count, rage::rlSessionByGamerTaskResult* result, int unk, bool* success, int* state);

using fpmsendinviteacceptedpresenceevent = void(*)(void* presenceStruct, rlPresenceEventInviteAccepted* invite, int flags);





typedef void(__cdecl* fpDisableErrorScreen)(void(char* entryHeader, char* entryLine1, int instructionalKey, char* entryLine2, BOOL p4, Any p5, Any* p6, Any* p7, BOOL background));
typedef void(__cdecl* fpRIDJoinFriends)(bool(int64_t* a1, int* hash));
//typedef void(__cdecl* fpRIDJoinFriendsV2)(bool(int* a1, __int64 a2, int* a3));
typedef void(__cdecl* fpRIDJoinFriendsV2)(int* a1, __int64 a2, int* a3);

typedef void(__cdecl* fpRIDJoinHandle)(std::int64_t* (int32_t friendIndex));
typedef void(__cdecl* fpRIDJoinFriendsHandler)(int64_t*);

typedef void(__cdecl* fpSpectatorCheck)(PUSHORT);


typedef void(__cdecl* fpRIDInviteFriends)(char(void* presenceStruct, rlPresenceEventInviteAccepted* invite, int flags));
typedef void(__cdecl* fpRIDInviteHandle)(char(int metric_manager, rage::rlGamerHandle* handles, int count, rage::rlSessionByGamerTaskResult* result, int unk, bool* success, int* state));

typedef void(__cdecl* fpNetworkSessionKickPlayer)(Player player, bool unk);

//using fpRIDJoinFriendsHandler = int64_t*;
//using fpRIDJoinHandle = std::int64_t* (int32_t friendIndex);
//using fpRIDJoinFriends = bool (int64_t* a1, int* hash);
namespace GameFunctions
{
	/*explicit GameFunctions();
	~GameFunctions() noexcept = default;
	GameFunctions(GameFunctions const&) = delete;
	GameFunctions(GameFunctions&&) = delete;
	GameFunctions& operator=(GameFunctions const&) = delete;
	GameFunctions& operator=(GameFunctions&&) = delete;*/
	static std::uint64_t** GlobalBase;


	/*static std::uint64_t** BaseGlobal;*/
	/*using pJoinPattern = int(__int64 a1, int a2, __int64* a3, int a4);
	pJoinPattern* m_JoinPattern;
	struct clockTime {
		int hour, minute, second;
	};
	clockTime* m_ClockTime;
	using SessionTime = void(int hour, int min);
	SessionTime* m_SessionTime;*/
}

//class MemoryHandle
//{
//public:
//	constexpr MemoryHandle(void* p = nullptr) :
//		m_Ptr(p)
//	{}
//
//	constexpr explicit MemoryHandle(std::uintptr_t p) :
//		m_Ptr(reinterpret_cast<void*>(p))
//	{}
//
//	template <typename T>
//	constexpr std::enable_if_t<std::is_pointer_v<T>, T> As()
//	{
//		return static_cast<T>(m_Ptr);
//	}
//
//	template <typename T>
//	constexpr std::enable_if_t<std::is_lvalue_reference_v<T>, T> As()
//	{
//		return *static_cast<std::add_pointer_t<std::remove_reference_t<T>>>(m_Ptr);
//	}
//
//	template <typename T>
//	constexpr std::enable_if_t<std::is_same_v<T, std::uintptr_t>, T> As()
//	{
//		return reinterpret_cast<T>(m_Ptr);
//	}
//
//	template <typename T>
//	constexpr MemoryHandle Add(T offset)
//	{
//		return MemoryHandle(As<std::uintptr_t>() + offset);
//	}
//
//	template <typename T>
//	constexpr MemoryHandle Sub(T offset)
//	{
//		return MemoryHandle(As<std::uintptr_t>() - offset);
//	}
//
//	constexpr MemoryHandle Rip()
//	{
//		if (!m_Ptr)
//			return nullptr;
//		return Add(As<std::int32_t&>()).Add(4U);
//	}
//
//	constexpr explicit operator bool() noexcept
//	{
//		return m_Ptr;
//	}
//protected:
//	void* m_Ptr;
//};

//class MemoryHandle
//{
//public:
//	constexpr MemoryHandle(void* p = nullptr) :
//		m_Ptr(p)
//	{}
//
//	/*constexpr */explicit MemoryHandle(std::uintptr_t p) :
//		m_Ptr(reinterpret_cast<void*>(p))
//	{}
//
//	template <typename T>
//	constexpr std::enable_if_t<std::is_pointer_v<T>, T> As()
//	{
//		return static_cast<T>(m_Ptr);
//	}
//
//	template <typename T>
//	constexpr std::enable_if_t<std::is_lvalue_reference_v<T>, T> As()
//	{
//		return *static_cast<std::add_pointer_t<std::remove_reference_t<T>>>(m_Ptr);
//	}
//
//	template <typename T>
//	constexpr std::enable_if_t<std::is_same_v<T, std::uintptr_t>, T> As()
//	{
//		return reinterpret_cast<T>(m_Ptr);
//	}
//
//	template <typename T>
//	constexpr MemoryHandle Add(T offset)
//	{
//		return MemoryHandle(As<std::uintptr_t>() + offset);
//	}
//
//	template <typename T>
//	constexpr MemoryHandle Sub(T offset)
//	{
//		return MemoryHandle(As<std::uintptr_t>() - offset);
//	}
//
//	constexpr MemoryHandle Rip()
//	{
//		if (!m_Ptr)
//			return nullptr;
//		return Add(As<std::int32_t&>()).Add(4U);
//	}
//
//	constexpr explicit operator bool() noexcept
//	{
//		return m_Ptr;
//	}
//protected:
//	void* m_Ptr;
//};
////////////////////////////////////////////////////////////////////////////////////////////////////////
//class MemoryHandle
//{
//public:
//	/**
//	 * \brief Constructs the object with a pointer
//	 * \param p The pointer to initialize the object with, optional
//	 */
//	constexpr MemoryHandle(void* p = nullptr) :
//		m_Ptr(p)
//	{}
//
//	/**
//	 * \brief Constructs the object with an integral pointer
//	 * \param p The integral pointer to initialize the object with
//	 */
//	explicit MemoryHandle(std::uintptr_t p) :
//		m_Ptr(reinterpret_cast<void*>(p))
//	{}
//
//	/**
//	 * \brief Retrieves the pointer as a pointer
//	 * \return A pointer
//	 */
//	template <typename T>
//	constexpr std::enable_if_t<std::is_pointer_v<T>, T> As()
//	{
//		return static_cast<T>(m_Ptr);
//	}
//
//	/**
//	 * \brief Retrieves the pointer as a reference
//	 * \return A pointer
//	 */
//	template <typename T>
//	constexpr std::enable_if_t<std::is_lvalue_reference_v<T>, T> As()
//	{
//		return *static_cast<std::add_pointer_t<std::remove_reference_t<T>>>(m_Ptr);
//	}
//
//	/**
//	 * \brief Retrieves the pointer as an integral pointer
//	 * \return An integral pointer
//	 */
//	template <typename T>
//	constexpr std::enable_if_t<std::is_same_v<T, std::uintptr_t>, T> As()
//	{
//		return reinterpret_cast<T>(m_Ptr);
//	}
//
//	/**
//	 * \brief Adds an offset to the pointer
//	 * \param offset The offset to be added
//	 * \return MemoryHandle
//	 */
//	template <typename T>
//	constexpr MemoryHandle Add(T offset)
//	{
//		return MemoryHandle(As<std::uintptr_t>() + offset);
//	}
//
//	/**
//	 * \brief Subtracted an offset to the pointer
//	 * \param offset The offset to be subtracted
//	 * \return MemoryHandle
//	 */
//	template <typename T>
//	constexpr MemoryHandle Sub(T offset)
//	{
//		return MemoryHandle(As<std::uintptr_t>() - offset);
//	}
//
//	/**
//	 * \brief Gets the relative displacement of the pointer
//	 * \return MemoryHandle
//	 */
//	constexpr MemoryHandle Rip()
//	{
//		if (!m_Ptr)
//			return nullptr;
//		return Add(As<std::int32_t&>()).Add(4U);
//	}
//
//	/**
//	 * \brief Checks if the stored pointer is valid
//	 * \return bool
//	 */
//	constexpr explicit operator bool() noexcept
//	{
//		return m_Ptr;
//	}
//protected:
//	void* m_Ptr;
//};
//
//class MemoryRegion
//{
//public:
//	constexpr explicit MemoryRegion(MemoryHandle base, std::size_t size) :
//		m_Base(base),
//		m_Size(size)
//	{}
//
//	constexpr MemoryHandle Base()
//	{
//		return m_Base;
//	}
//
//	constexpr MemoryHandle End()
//	{
//		return m_Base.Add(m_Size);
//	}
//
//	constexpr std::size_t Size()
//	{
//		return m_Size;
//	}
//
//	constexpr bool Contains(MemoryHandle p)
//	{
//		if (p.As<std::uintptr_t>() < m_Base.As<std::uintptr_t>())
//			return false;
//		if (p.As<std::uintptr_t>() > m_Base.Add(m_Size).As<std::uintptr_t>())
//			return false;
//
//		return true;
//	}
//protected:
//	MemoryHandle m_Base;
//	std::size_t m_Size;
//};
//
//class Module : public MemoryRegion
//{
//public:
//	explicit Module(std::nullptr_t) :
//		Module(static_cast<char*>(nullptr))
//	{}
//
//	explicit Module(const char* name) :
//		Module(GetModuleHandleA(name))
//	{
//	}
//
//	Module(HMODULE hmod) :
//		MemoryRegion(hmod, 0)
//	{
//		auto dosHeader = m_Base.As<IMAGE_DOS_HEADER*>();
//		auto ntHeader = m_Base.Add(dosHeader->e_lfanew).As<IMAGE_NT_HEADERS64*>();
//		m_Size = ntHeader->OptionalHeader.SizeOfImage;
//	}
//
//	template <typename TReturn, typename TOffset>
//	TReturn GetRVA(TOffset rva)
//	{
//		return m_Base.Add(rva).As<TReturn>();
//	}
//
//	IMAGE_DOS_HEADER* GetDosHeaders()
//	{
//		return m_Base.As<IMAGE_DOS_HEADER*>();
//	}
//
//	IMAGE_NT_HEADERS64* GetNtHeaders()
//	{
//		return m_Base.Add(m_Base.As<IMAGE_DOS_HEADER*>()->e_lfanew).As<IMAGE_NT_HEADERS64*>();
//	}
//};

class MemoryHandle
{
public:
	constexpr MemoryHandle(void* p = nullptr) :
		m_Ptr(p)
	{}
	/*constexpr explicit MemoryHandle(std::uintptr_t p) :*/
	explicit MemoryHandle(std::uintptr_t p) :
		m_Ptr(reinterpret_cast<void*>(p))
	{}

	template <typename T>
	constexpr std::enable_if_t<std::is_pointer_v<T>, T> As()
	{
		return static_cast<T>(m_Ptr);
	}

	template <typename T>
	constexpr std::enable_if_t<std::is_lvalue_reference_v<T>, T> As()
	{
		return *static_cast<std::add_pointer_t<std::remove_reference_t<T>>>(m_Ptr);
	}

	template <typename T>
	constexpr std::enable_if_t<std::is_same_v<T, std::uintptr_t>, T> As()
	{
		return reinterpret_cast<T>(m_Ptr);
	}

	template <typename T>
	constexpr MemoryHandle Add(T offset)
	{
		return MemoryHandle(As<std::uintptr_t>() + offset);
	}

	template <typename T>
	constexpr MemoryHandle Sub(T offset)
	{
		return MemoryHandle(As<std::uintptr_t>() - offset);
	}

	constexpr MemoryHandle Rip()
	{
		if (!m_Ptr)
			return nullptr;
		return Add(As<std::int32_t&>()).Add(4U);
	}

	constexpr explicit operator bool() noexcept
	{
		return m_Ptr;
	}
protected:
	void* m_Ptr;
};

class MemoryRegion
{
public:
	constexpr explicit MemoryRegion(MemoryHandle base, std::size_t size) :
		m_Base(base),
		m_Size(size)
	{}

	constexpr MemoryHandle Base()
	{
		return m_Base;
	}

	constexpr MemoryHandle End()
	{
		return m_Base.Add(m_Size);
	}

	constexpr std::size_t Size()
	{
		return m_Size;
	}

	constexpr bool Contains(MemoryHandle p)
	{
		if (p.As<std::uintptr_t>() < m_Base.As<std::uintptr_t>())
			return false;
		if (p.As<std::uintptr_t>() > m_Base.Add(m_Size).As<std::uintptr_t>())
			return false;

		return true;
	}
protected:
	MemoryHandle m_Base;
	std::size_t m_Size;
};

class Module : public MemoryRegion
{
public:
	explicit Module(std::nullptr_t) :
		Module(static_cast<char*>(nullptr))
	{}

	explicit Module(const char* name) :
		Module(GetModuleHandleA(name))
	{
	}

	Module(HMODULE hmod) :
		MemoryRegion(hmod, 0)
	{
		auto dosHeader = m_Base.As<IMAGE_DOS_HEADER*>();
		auto ntHeader = m_Base.Add(dosHeader->e_lfanew).As<IMAGE_NT_HEADERS64*>();
		m_Size = ntHeader->OptionalHeader.SizeOfImage;
	}

	template <typename TReturn, typename TOffset>
	TReturn GetRVA(TOffset rva)
	{
		return m_Base.Add(rva).As<TReturn>();
	}

	IMAGE_DOS_HEADER* GetDosHeaders()
	{
		return m_Base.As<IMAGE_DOS_HEADER*>();
	}

	IMAGE_NT_HEADERS64* GetNtHeaders()
	{
		return m_Base.Add(m_Base.As<IMAGE_DOS_HEADER*>()->e_lfanew).As<IMAGE_NT_HEADERS64*>();
	}
};

class Signature
{
public:
	struct Element
	{
		std::uint8_t m_Data{};
		bool m_Wildcard{};
	};

	explicit Signature(const char* pattern, const char* patternlog)
	{
		Log::Msg(patternlog);

		auto toUpper = [](char c) -> char
		{
			return c >= 'a' && c <= 'z' ? static_cast<char>(c + ('A' - 'a')) : static_cast<char>(c);
		};

		auto isHex = [&](char c) -> bool
		{
			switch (toUpper(c))
			{
			case '0':
			case '1':
			case '2':
			case '3':
			case '4':
			case '5':
			case '6':
			case '7':
			case '8':
			case '9':
			case 'A':
			case 'B':
			case 'C':
			case 'D':
			case 'E':
			case 'F':
				return true;
			default:
				return false;
			}
		};

		do
		{
			if (*pattern == ' ')
				continue;
			if (*pattern == '?')
			{
				m_Elements.push_back(Element{ {}, true });
				continue;
			}

			if (*(pattern + 1) && isHex(*pattern) && isHex(*(pattern + 1)))
			{
				char str[3] = { *pattern, *(pattern + 1), '\0' };
				auto data = std::strtol(str, nullptr, 16);

				m_Elements.push_back(Element{ static_cast<std::uint8_t>(data), false });
			}
		} while (*(pattern++));
	}

	MemoryHandle Scan(MemoryRegion region = Module(nullptr))
	{
		auto compareMemory = [](std::uint8_t* data, Element* elem, std::size_t num) -> bool
		{
			for (std::size_t i = 0; i < num; ++i)
			{
				if (!elem[i].m_Wildcard)
					if (data[i] != elem[i].m_Data)
						return false;
			}

			return true;
		};

		for (std::uintptr_t i = region.Base().As<std::uintptr_t>(), end = region.End().As<std::uintptr_t>(); i != end; ++i)
		{
			if (compareMemory(reinterpret_cast<std::uint8_t*>(i), m_Elements.data(), m_Elements.size()))
			{
				return MemoryHandle(i);
			}
		}

		return {};
	}
private:
	std::vector<Element> m_Elements;
};


class CNetGamePlayer2 : public rage::netPlayer
{
public:
	CPlayerInfo* m_player_info; //0x00A0
	uint32_t m_matchmaking_group; //0x0008
	bool m_is_spectating; //0x000C
	char pad_00AD[3]; //0x000AD
	uint64_t unk_00B0; //0x00B0
	char unk_00B8; //0x00B8
	char pad_00B9[3]; //0x00B9
	uint32_t unk_00BC; //0x00BC
	uint32_t unk_00C0; //0x00C0
	char pad_00C4[4]; //0x00C4
	ClanData m_clan_data; //0x00C8
	char m_crew_rank_title[25]; //0x0180
	bool m_is_rockstar_dev; //0x0199
	bool m_is_rockstar_qa; //0x019A
	bool m_is_cheater; //0x019B
	uint32_t unk_019C; //0x019C
	uint16_t unk_01A0; //0x01A0
	char unk_01A2; //0x01A2
	char pad_01A3; //0x01A3
	uint32_t m_phone_explosion_vehicle_net_id; //0x01A4
	uint16_t unk_01A8; //0x01A8
	bool m_has_started_transition; //0x01AA
	char pad_01AB[5]; //0x01AB
	rage::rlSessionInfo m_transition_session_info; //0x01A3
	char pad_022D[16]; //0x022D
	uint64_t unk_0230; //0x0230
	uint64_t unk_0238; //0x0238
	uint32_t m_mute_count; //0x0240
	uint32_t m_mute_talkers_count; //0x0244
	char pad_0248[5]; //0x0248
	bool m_have_communication_privileges; //0x024D
	uint16_t unk_024E; //0x024E
	uint16_t unk_0250; //0x0250
	char pad_0252[2]; //0x0252
	uint32_t m_cheat_report_ids[20]; //0x0254
	uint32_t m_num_cheat_reports; //0x02A4
	uint8_t unk_02A8; //0x02A8
	char pad_02A9[3]; //0x02A9
	uint32_t unk_02AC; //0x02AC
	char unk_02B0; //0x02B0
	char pad_02B1[3]; //0x02B1
	uint32_t unk_02B4; //0x02B4
	uint32_t m_account_id; //0x02B4
	uint32_t m_unk_02BC; //0x02BC
}; //Size: 0x02C0

typedef long long int64__;
typedef void(__cdecl* fpChatMessage)(__int64 a1, __int64 a2, __int64 a3, char* message);
using fpGetSender = CNetGamePlayer2*(__int64);


typedef void(__cdecl* GlobalBase)(std::uint64_t** m_GlobalBase);
class hook_sender
{
public:
	explicit hook_sender();
	~hook_sender() noexcept = default;
	hook_sender(hook_sender const&) = delete;
	hook_sender(hook_sender&&) = delete;
	hook_sender& operator=(hook_sender const&) = delete;
	hook_sender& operator=(hook_sender&&) = delete;
	static fpGetSender* get_sender;
	static GlobalBase* baseGlobal;
};
inline std::unique_ptr<hook_sender> g_sender;

typedef char* (__cdecl* sub7FF71339282C)(int* a1, __int64 a2, int* a3);
//char __fastcall 

class Hooking
{
private:
	static BOOL InitializeHooks();
	/*void fileregistermax();*/
	static void FindPatterns();
	static void FailPatterns(const char* name);
public:
	static void JoinPatterns();
	static sub7FF71339282C sub_7FF71339282C;
	/*static BOOL hk_ridJoiner(int64_t* a1, int* hash);*/
	static HMODULE _hmoduleDLL;
	static patternglobal globalpattern;
	static listblip bliplist;
	static patternworld worldpattern;
	static void* invoker_return_address;
	static PVOID m_native_return;
	static void* pickupdrop;
	static fpreplay			replay_interface;
	static fplaylist player_list;
	static fpunkmodel unk_model;

	static fphandlingindex handling_index;
	static fphandlinghash handling_hash;
	static fphandlingIndexOffset handlingIndexOffsetInModelInfo;
	static fpPedPoolAddress PedPoolAddress;
	static fpObjectPoolAddress ObjectPoolAddress;
	static fpEntityPoolAddress EntityPoolAddress;
	static fpVehiclePoolAddress VehiclePoolAddress;
	static fpPickupObjectPoolAddress PickupObjectPoolAddress;



	static fpvehicleClassOffset vehicleClassOffset;
	static fpmodelNum1 modelNum1;
	static fpmodelNum2 modelNum2;
	static fpmodelNum3 modelNum3;
	static fpmodelNum4 modelNum4;
	static fpmodelHashTable modelHashTable;
	static fpmodelHashEntries modelHashEntries;

	//static fpSTARTPARTICLEFXNONLOOPEDONENTITY2            _START_PARTICLE_FX_NON_LOOPED_ON_ENTITY_2;
	/*static void*					m_onlineName;*/
	/*static void rid_main(int rid);*/
	static bool Hooking::protect;
	static bool Hooking::redirectAll;
	/*static bool Hooking::protectsr;*/
	static bool Hooking::nonhostkicks;
	static bool Hooking::noteleports;
	static bool Hooking::nosoundspams;
	static bool Hooking::ceokicks;
	static bool Hooking::missionsend;
	static bool Hooking::errortransaction;
	static bool Hooking::bounties;
	static bool Hooking::notifications;
	static bool Hooking::wantedlevels;
	static bool Hooking::dump;
	static bool Hooking::GED(int eventGroup, int eventIndex, __int64* argStruct, int argStructSize);
	static fpFileRegister            pRegisterFile;
	static bool Hooking::spectateplayer;
	static void Hooking::setinspectatormode(BOOL toggle, Ped playerPed);
	static void Hooking::settime(int Hours, int Minutes, int Seconds);
	static std::vector<LPVOID>		m_hooks;
	static uint64_t* m_frameCount;
	static fpIsDLCPresent			is_DLC_present;
	static fpsIncrementStatEvent	IncrementStatEvent;
	//static fpSetName			    SetName;
	static fpAddOwnedExplosion      add_owned_explosion;
	static void						ExplosionBypass(bool toggle);
	static void						ownedExplosionBypass(bool toggle);
	static fpTriggerScriptEvent	    trigger_script_event;
	static fpSetLobbyWeather	    set_lobby_weather;
	static fpGetEventData	        get_event_data;
	static fpIncrementStatHook	    increment_stat_hook;
	static fpSetLobbyTime	        set_lobby_time;
	static fpSendMessage2	        send_message2;
	/*static fpGetPlayerPed	        get_player_ped;*/
	static fpGetPlayerAddress       GetPlayerAddress;
	static fpAddressToEntity		AddressToEntity;
	static fpGetPlayerName	        get_player_name;
	static fpNetworkIsSessionStarted	network_is_session_started;
	/*static Receive						m_ChatReceive;
	static ChatPlayerID					m_GetChatPlayerID;*/
	/*static __int64* m_ChatReceive;*/
	static fpChatMessage                           get_message;

	static fpNetworkSessionKickPlayer              network_session_kick_player;
	/*static GetChatPlayerID* m_GetChatPlayerID;*/

	/*static CNetworkIncrementStatEvent	NetworkIncrementStatEvent;*/
	/*static fpGetPlayerPedScriptIndex	        get_player_ped_script_index;*/
	static fpAddTextCompSubstrPlayerName	    add_text_comp_substr_playername;
	static fpEndTextCmdDisplayText	    end_text_cmd_display_text;
	static fpBeginTextCmdDisplayText	    begin_text_cmd_display_text;
	/*static fpIsPedShooting	        is_ped_shooting;*/
	static fpStatSetInt							stat_set_int;
	static fpStatGetInt							stat_get_int;
	static fpStatSetFloat						stat_set_float;
	static fpStatSetBool						stat_set_bool;
	static fpCreateAmbientPickup				create_ambient_pickup;
	static SETVEHICLEFORWARDSPEED				SET_VEHICLE_FORWARD_SPEED;
	/*static fpCreateAmbientPickup2				create_ambient_pickup2;*/
	static fpREQUESTMODEL				request_model;
	/*static fpHASMODELLOADED				has_model_loaded;*/
	static fpISMODELAVEHICLE			is_model_a_vehicle;
	//static fp_CreateObject						create_object;
	//static fpNetworkShopBeginService		network_shop_begin_service;
	static void Start(HMODULE hmoduleDLL);
	static void Cleanup();
	static eGameState GetGameState();
	static uint64_t getWorldPtr();
	static void onTickInit();
	static void onTickInit2();
	static bool HookNatives();
	/*static bool HookGetEvent(int eventGroup, int eventIndex, uint64_t * argStruct, int argStructSize);*/
	static __int64** getGlobalPtr();
	/*static __int64* getGlobalPtr1(int index);
	static __int64* setTunable(int Tunable);*/
	static void defuseEvent(RockstarEvent e, bool toggle);
	static void patchEvent(RockstarEvent e, bool toggle);

	static __int64* getGlobalPatern(int index);
	/*static bool loadmods;*/
	static Ped get_player_ped(Player player);
	/*static fpPlayerId							player_id;*/
	// Native function handler type
	typedef void(__cdecl* NativeHandler)(scrNativeCallContext* context);

	static fpGetLabelText GetLabelText;
	using fpGetLabelText = const char* (*) (void* this_, const char* label);

	static fpRemoveWeapons RemoveWeapons;
	static fpmstartgetsessionbygamerhandle m_start_get_session_by_gamer_handle;
	static fpmsendinviteacceptedpresenceevent m_send_invite_accepted_presence_event;
	using fpmstartgetsessionbygamerhandle = bool(*)(int metric_manager, rage::rlGamerHandle* handles, int count, rage::rlSessionByGamerTaskResult* result, int unk, bool* success, int* state);
	using fpmsendinviteacceptedpresenceevent = void(*)(void* presenceStruct, rlPresenceEventInviteAccepted* invite, int flags);

	static fpmpresencestruct m_presence_struct;

	static fpDisableErrorScreen DisableErrorScreen;
	//using fpDisableErrorScreen = void(char* entryHeader, char* entryLine1, int instructionalKey, char* entryLine2, BOOL p4, Any p5, Any* p6, Any* p7, BOOL background);
	static fpRIDJoinFriends RIDJoinFriends;
	static fpRIDJoinFriendsV2 RIDJoinFriendsV2;
	static fpRIDJoinHandle RIDJoinHandle;
	//using fpRIDJoinFriendsHandler = int64_t*;
	static fpRIDJoinFriendsHandler RIDJoinFriendsHandler;
	static fpSpectatorCheck SpectatorCheck;

	static fpRIDInviteFriends      RIDInviteFriends;
	static fpRIDInviteHandle        RIDInviteHandle;

	/*using fpRIDJoinHandle = std::int64_t* (int32_t friendIndex);
	using fpRIDJoinFriends = bool (int64_t* a1, int* hash);*/

	struct NativeRegistrationNew
	{
		uint64_t nextRegistration1;
		uint64_t nextRegistration2;
		Hooking::NativeHandler handlers[7];
		uint32_t numEntries1;
		uint32_t numEntries2;
		uint64_t hashes;

		inline NativeRegistrationNew* getNextRegistration()
		{
			uintptr_t result;
			auto v5 = reinterpret_cast<uintptr_t>(&nextRegistration1);
			auto v12 = 2i64;
			auto v13 = v5 ^ nextRegistration2;
			auto v14 = (char*)&result - v5;
			do
			{
				*(DWORD*)&v14[v5] = (DWORD)v13 ^ *(DWORD*)v5;
				v5 += 4i64;
				--v12;
			} while (v12);

			return reinterpret_cast<NativeRegistrationNew*>(result);
		}

		inline uint32_t getNumEntries()
		{
			return (reinterpret_cast<uintptr_t>(&numEntries1)) ^ numEntries1 ^ numEntries2;
		}
		/*inline void setNumEntries(uint32_t entries)
		{
			numEntries1 = (uint32_t)& numEntries1 ^ entries;
			numEntries2 = 0;
		}*/
		inline uint64_t getHash(uint32_t index)
		{
			auto naddr = 16 * index + reinterpret_cast<uintptr_t>(&nextRegistration1) + 0x54;
			auto v8 = 2i64;
			uint64_t nResult;
			auto v11 = (char*)&nResult - naddr;
			auto v10 = naddr ^ *(DWORD*)(naddr + 8);
			do
			{
				*(DWORD*)&v11[naddr] = (DWORD)v10 ^ *(DWORD*)(naddr);
				naddr += 4i64;
				--v8;
			} while (v8);

			return nResult;
		}
	};
	static NativeHandler GetNativeHandler(uint64_t origHash);

	static bool geteventdata;
	static void* m_OriginalJoinPlayer;
};


void WAIT(DWORD ms);
void WAIT2(DWORD ms);

//enum eThreadState
//{
//	ThreadStateIdle = 0x0,
//	ThreadStateRunning = 0x1,
//	ThreadStateKilled = 0x2,
//	ThreadState3 = 0x3,
//	ThreadState4 = 0x4,
//};
//
//struct scrThreadContext
//{
//	int ThreadID;
//	int ScriptHash;
//	eThreadState State;
//	int _IP;
//	int FrameSP;
//	int _SPP;
//	float TimerA;
//	float TimerB;
//	int TimerC;
//	int _mUnk1;
//	int _mUnk2;
//	int _f2C;
//	int _f30;
//	int _f34;
//	int _f38;
//	int _f3C;
//	int _f40;
//	int _f44;
//	int _f48;
//	int _f4C;
//	int _f50;
//	int pad1;
//	int pad2;
//	int pad3;
//	int _set1;
//	int pad[17];
//};

//struct scrThread
//{
//	void *vTable;
//	scrThreadContext m_ctx;
//	void *m_pStack;
//	void *pad;
//	void *pad2;
//	const char *m_pszExitMessage;
//};
//


/*
//CPatternResult
*/

class CPatternResult
{
public:
	CPatternResult(void* pVoid);
	CPatternResult(void* pVoid, void* pBegin, void* pEnd);
	~CPatternResult();

	template <typename rT>
	rT* get(int offset = 0)
	{
		rT* ret = nullptr;
		if (m_pVoid != nullptr)
			ret = reinterpret_cast<rT*>(reinterpret_cast<char*>(m_pVoid) + offset);
		return ret;
	}

	template <typename rT>
	rT* get_rel(int offset = 0)
	{
		rT* result = nullptr;
		int32_t	rel;
		char* ptr = get<char>(offset);

		if (ptr == nullptr)
			goto LABEL_RETURN;

		rel = *(int32_t*)ptr;
		result = reinterpret_cast<rT*>(ptr + rel + sizeof(rel));

	LABEL_RETURN:
		return result;
	}

	template <typename rT>
	rT* section_begin()
	{
		return reinterpret_cast<rT*>(m_pBegin);
	}

	template <typename rT>
	rT* section_end()
	{
		return reinterpret_cast<rT*>(m_pEnd);
	}

protected:
	void* m_pVoid = nullptr;
	void* m_pBegin = nullptr;
	void* m_pEnd = nullptr;
};

class CMetaData
{
public:
	static uint64_t	begin();
	static uint64_t	end();
	static DWORD	size();
	static void		init();
private:
	static uint64_t	m_begin;
	static uint64_t	m_end;
	static DWORD	m_size;
};

struct twoBytes
{
	BYTE	bytes[2];

	bool	empty();
};

class CBlip
{
public:
	__int32 iID; //0x0000 
	__int8 iID2; //0x0004 
	char _0x0005[3];
	BYTE N000010FB; //0x0008 (80 = moves with player, some values will turn icon into map cursor and break it)
	char _0x0009[7];
	Vector3 v3Pos;
	char _0x001C[6];
	BYTE btFocused; //0x0022   (Focused? 0100 0000)
	char _0x0023[5];
	char* szMessage; //0x0028 If not null, contains the string of whatever the blip says when selected.
	char _0x0030[16];
	int iIcon; //0x0040
	char _0x0044[4];
	DWORD dwColor; //0x0048 (Sometimes works?)
	char _0x004C[4];
	float fScale; //0x0050 
	__int16 iRotation; //0x0054 Heading
	BYTE btInfoIDType; //0x0056 GET_BLIP_INFO_ID_TYPE
	BYTE btZIndex; //0x0057 
	BYTE btDisplay; //0x0058  Also Visibility 0010
	BYTE btAlpha; //0x0059
};//Size=0x005A

/*
//CPattern
*/
typedef	std::vector<CPatternResult>	vec_result;
class CPattern
{
public:
	CPattern(char* szByte, char* szMask);
	~CPattern();

	CPattern& find(int i = 0, uint64_t startAddress = 0);		//scans for i patterns
	CPattern& virtual_find(int i = 0, uint64_t startAddress = 0);
	CPatternResult	get(int i);				//returns result i

protected:
	char* m_szByte;
	char* m_szMask;
	bool			m_bSet;
	vec_result		m_result;

	bool		match(int i = 0, uint64_t startAddress = 0, bool virt = false);
	bool		byte_compare(const BYTE* pData, const BYTE* btMask, const char* szMask);
	uint64_t	find_pattern(uint64_t i64Address, uint64_t end, BYTE* btMask, char* szMask);
	uint64_t	virtual_find_pattern(uint64_t address, BYTE* btMask, char* szMask);
};
class CHooking
{
public:
	static twoBytes* m_ownedExplosionBypass;
	/*static BYTE* m_ownedExplosionBypass;*/
	static fpDrawRect							draw_rect;
	//static fpDrawLine							draw_line;
